Finding Missing Data
Removing Missing Data
Fill pandas DAta

In [3]:
import numpy as np
import pandas as pd

## Finding Missing Data

In [14]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, np.nan, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df = pd.DataFrame(data)

In [15]:
df

     A    B    C    D
0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  NaN  NaN  NaN
4  5.0  5.0  NaN  5.0

In [16]:
df.isna() #this isna is null value

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False   True   True   True
4  False  False   True  False

In [17]:
df.isna().sum() # all the value in sum and it is used

A    1
B    1
C    2
D    3
dtype: int64

In [19]:
df.isna().any() #  this table in check in null value is (any())

A    True
B    True
C    True
D    True
dtype: bool

## Removing Missing Data

In [28]:
df

     A    B    C    D
0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  NaN  NaN  NaN
4  5.0  5.0  NaN  5.0

In [ ]:
df.drop(0,axis=0,inplace=True) # this row delete permanently

In [35]:
df.dropna() # removing  the data depandant in rowwise in used in (dropna)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [37]:
df

     A    B    C    D
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  NaN  NaN  NaN
4  5.0  5.0  NaN  5.0

In [40]:
df.dropna(thresh=3) # the unse in thresh ()add the number and minimum null value

     A    B    C    D
1  2.0  2.0  2.0  NaN
4  5.0  5.0  NaN  5.0

## Filling the missing data

In [42]:
df

     A    B    C    D
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  NaN  NaN  NaN
4  5.0  5.0  NaN  5.0

In [44]:
df.fillna(0) # this data fill and used (Fillna)

     A    B    C    D
1  2.0  2.0  2.0  0.0
2  0.0  3.0  3.0  0.0
3  4.0  0.0  0.0  0.0
4  5.0  5.0  0.0  5.0

In [48]:
values = { "A":0.12,"B":100,"C":300,"D":400} # used in disctionary and show in null value then replace in value 
df.fillna(value=values)

      A      B      C      D
1  2.00    2.0    2.0  400.0
2  0.12    3.0    3.0  400.0
3  4.00  100.0  300.0  400.0
4  5.00    5.0  300.0    5.0

In [50]:
df

     A    B    C    D
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  NaN  NaN  NaN
4  5.0  5.0  NaN  5.0

In [51]:
df.fillna(df.mean())

          A         B    C    D
1  2.000000  2.000000  2.0  5.0
2  3.666667  3.000000  3.0  5.0
3  4.000000  3.333333  2.5  5.0
4  5.000000  5.000000  2.5  5.0